Функция СведенияОВнешнейОбработке() Экспорт
   
    РегистрационныеДанные = Новый Структура;
    РегистрационныеДанные.Вставить("Наименование", "Отчет по внешним кодам");
    РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
    РегистрационныеДанные.Вставить("Версия", "1.0.3");
  
    //ДополнительнаяОбработка
    //ДополнительныйОтчет
    //ЗаполнениеОбъекта
    //Отчет
    //ПечатанаяФорма
    //СозданиеСвязанныхОбъектов
    РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
  
    РегистрационныеДанные.Вставить("Информация", "Отчет по внешним кодам");
  
    ///////////// команды /////////////////////////
    тзКоманд = Новый ТаблицаЗначений;
    тзКоманд.Колонки.Добавить("Идентификатор");
    тзКоманд.Колонки.Добавить("Представление");
    тзКоманд.Колонки.Добавить("Модификатор");
    тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
    тзКоманд.Колонки.Добавить("Использование");
  
    строкаКоманды = тзКоманд.Добавить();
    строкаКоманды.Идентификатор = "ОтчетПоВнешнимКодам";
    строкаКоманды.Представление = "Отчет по внешним кодам";
    строкаКоманды.ПоказыватьОповещение = Истина;
    строкаКоманды.Модификатор = "";
    строкаКоманды.Использование = "ОткрытиеФормы";
  
    РегистрационныеДанные.Вставить("Команды", тзКоманд);
  
    ////////////// назначение (в каких объектах используется) /////////////////////////
    //для печ.форм, заполнения, ввода свазанных объектов
    //МассивНазначений = Новый Массив;
    //МассивНазначений.Добавить("Документ.*"); // все документы назначаются
    //МассивНазначений.Добавить("Документ.ПоступлениеТоваровУслуг");
    //МассивНазначений.Добавить("Документ.ЗаказПокупателя");
    //РегистрационныеДанные.Вставить("Назначение", МассивНазначений);
  
    Возврат РегистрационныеДанные;
              
КонецФункции