
&НаСервере
Процедура Команда1НаСервере()

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект,
		|	ДополнительныеСведения.Свойство,
		|	ДополнительныеСведения.Значение,
		|	ДополнительныеСведения.Свойство.Заголовок КАК Заголовок
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство.НаборСвойств = &НаборСвойств
		|	И ДополнительныеСведения.Свойство В(&СписокСвойств)";
	
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойствСтарый);
	Запрос.УстановитьПараметр("СписокСвойств", СписокСвойств.ВыгрузитьЗначения());

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТзСвойсвтв=ПолучитьТзСвойств(НаборСвойствНовый);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовоеСвойство=ПолучитьСвойство(ВыборкаДетальныеЗаписи.Заголовок, ТзСвойсвтв, "1");
		
		Если НовоеСвойство.Пустая() Тогда
			Продолжить;
		КонецЕсли;	
		
		СоотвСвойства=Новый Соответствие;
		СоотвСвойства.Вставить(НовоеСвойство, ВыборкаДетальныеЗаписи.Значение);
		
		СоздатьОбновитьОбъект(ВыборкаДетальныеЗаписи.объект, СоотвСвойства);

	КонецЦикла;
	
	
	 УдалитьСтарыеСведения(РезультатЗапроса.Выгрузить());
	 
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

Процедура УдалитьСтарыеСведения(ТзСвойств)

	ТзСвойств.Свернуть("Свойство");
	массивСвойств=ТзСвойств.выгрузитьКолонку("Свойство");
	
	Для Каждого Свойство из массивСвойств Цикл
		НЗ=РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
		Нз.Отбор.Свойство.Установить(Свойство);
		Нз.Записать(Истина);
		
	КонецЦикла;	
	

КонецПроцедуры


Функция ПолучитьСвойство(пЗаголовоСвойства, пТзСвойств, пДопСимвол="")

   МассивСтрокТзСвв=пТзСвойств.НайтиСтроки(Новый Структура("Заголовок", пЗаголовоСвойства+пДопСимвол));
   
   Для Каждого СтрокаТзСвВ из МассивСтрокТзСвв Цикл
	   
	   Возврат  СтрокаТзСвВ.Ссылка;
	   
   КонецЦикла; 

   Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка();
   
КонецФункции // НайтиСвойство()


Процедура СоздатьОбновитьОбъект(пОбъект, пСтруктСвойств)

	ИмяТчРеквизитов="ДополнительныеРеквизиты";
	НовыйОбъект=пОбъект.ПолучитьОбъект();

	
	
	
	ЗаполнитьТЧ_Свойств(НовыйОбъект[ИмяТчРеквизитов], пСтруктСвойств);

	
	Попытка
		ТекстСообщение="Записан "+Строка(пОбъект);
		НовыйОбъект.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;

	
	

	
КонецПроцедуры


Функция ПолучитьТзСвойств(пНаборСвойств)
	
	Перем Запрос, РезультатЗапроса, ТзСвойсвтв;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка,
	|	ДополнительныеРеквизитыИСведения.Наименование,
	|	ДополнительныеРеквизитыИСведения.Заголовок
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств
	|	И ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НаборСвойств", пНаборСвойств);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТзСвойсвтв=РезультатЗапроса.Выгрузить();
	Возврат ТзСвойсвтв;

КонецФункции // ()



Процедура ЗаполнитьТЧ_Свойств( ТчСвойств, СтруктСвойств)
	
	
	Для Каждого Свойство из  СтруктСвойств Цикл

		ЗначениеСвойства=ПолучитьЗначениеСвойства( Свойство.Ключ, Свойство.Значение);
		
		Если ЗначениеСвойства=Неопределено Тогда
			Продолжить;
		КонецЕсли;	

		
		НоваяСтрокаТЧ=ТчСвойств.Добавить();

		НоваяСтрокаТЧ.Свойство = Свойство.Ключ; 
		
			
		НоваяСтрокаТЧ.Значение = ЗначениеСвойства;
		
	КонецЦикла;
КонецПроцедуры


Функция ПолучитьЗначениеСвойства(пСвойство, пЗначение)

	Если ТипЗнч(пЗначение)=тип("Строка") или ТипЗнч(пЗначение)=тип("Число") Тогда
		
		Возврат пЗначение;
		
	ИначеЕсли  ТипЗнч(пЗначение)=тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
		
		ИскЗначение=Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(пЗначение.Наименование, Истина,, пСвойство);
		
		Если ИскЗначение.Пустая() Тогда
			
			НовОбъект=Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			НовОбъект.Наименование= пЗначение.Наименование;
			НовОбъект.Владелец=пСвойство;
			
			Попытка
			
				НовОбъект.Записать();
			
			Исключение
			     Сообщение = Новый СообщениеПользователю;
				 Сообщение.Текст = ОписаниеОшибки();
				 Сообщение.Сообщить();
			КонецПопытки;
			
			Возврат НовОбъект.Ссылка;
		Иначе
			Возврат ИскЗначение;

		КонецЕсли;	
		
	иначе
		
		Возврат Неопределено;
		
	КонецЕсли;	
	

КонецФункции // ПолучитьЗначениеСправочника()


&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
