

  Функция СведенияОВнешнейОбработке() Экспорт
	  
	  РегистрационныеДанные = Новый Структура;
         РегистрационныеДанные.Вставить("Наименование", "Заполнение установки цен из Excel");
         РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
         РегистрационныеДанные.Вставить("Версия", "1.0");
         
         //ДополнительнаяОбработка
         //ДополнительныйОтчет
         //ЗаполнениеОбъекта
         //Отчет
         //ПечатнаяФорма
         //СозданиеСвязанныхОбъектов
         РегистрационныеДанные.Вставить("Вид", "ЗаполнениеОбъекта");
         
         РегистрационныеДанные.Вставить("Информация", " Обработка позволяется заполнять  ТЧ док-та из уст. цен ексель см. справку по обработке");
         
         ///////////// команды /////////////////////////
         тзКоманд = Новый ТаблицаЗначений;
         тзКоманд.Колонки.Добавить("Идентификатор");
         тзКоманд.Колонки.Добавить("Представление");
         тзКоманд.Колонки.Добавить("Модификатор");
         тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
         тзКоманд.Колонки.Добавить("Использование");
         
         строкаКоманды = тзКоманд.Добавить();
         строкаКоманды.Идентификатор = "1";
         строкаКоманды.Представление = "Заполнение установки цен из Excel";
         строкаКоманды.ПоказыватьОповещение = Истина;
         строкаКоманды.Использование = "ОткрытиеФормы";
         
		 //строкаКоманды = тзКоманд.Добавить();
		 //строкаКоманды.Идентификатор = "2";
		 //строкаКоманды.Представление = "команда ""Hello Word"" (ВызовКлиентскогоМетода)";
		 //строкаКоманды.ПоказыватьОповещение = Истина;
		 //строкаКоманды.Использование = "ВызовКлиентскогоМетода";
		 //
		 //строкаКоманды = тзКоманд.Добавить();
		 //строкаКоманды.Идентификатор = "3";
		 //строкаКоманды.Представление = "команда ""Hello Word"" (ВызовСерверногоМетода)";
		 //строкаКоманды.ПоказыватьОповещение = Истина;
		 //строкаКоманды.Использование = "ВызовСерверногоМетода";
         
         РегистрационныеДанные.Вставить("Команды", тзКоманд);
         
         ////////////// назначение (в каких объектах используется) /////////////////////////
         //для печ.форм, заполнения, ввода свазанных объектов
         МассивНазначений = Новый Массив;
         МассивНазначений.Добавить("Документ.УстановкаЦенНоменклатуры"); // все документы назначаются
         //МассивНазначений.Добавить("Документ.АвансовыйОтчет");
         //МассивНазначений.Добавить("Документ.ЗаказПокупателя");
         РегистрационныеДанные.Вставить("Назначение", МассивНазначений);
         
         Возврат РегистрационныеДанные;
         
     КонецФункции