
&НаСервере
Процедура УстановитьИдентифкаторНаСервере(пБ_Идентификатор, пЭлемент)
	// Вставить содержимое обработчика.
	
	ЗаписываемыйОбъект=пЭлемент.ПолучитьОбъект();
	ЗаписываемыйОбъект.Б_Идентификатор=пБ_Идентификатор;
	Попытка
		
		ЗаписываемыйОбъект.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Записан идентификатор "+пБ_Идентификатор+" для объекта "+строка(ЗаписываемыйОбъект);
		Сообщение.УстановитьДанные(ЗаписываемыйОбъект);
		Сообщение.Сообщить();
		
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИдентифкатор(Команда)
	УстановитьИдентифкаторНаСервере(Б_Идентификатор, Элемент);
КонецПроцедуры
