Перем ТЗ Экспорт;

Процедура Инициализировать(Объект,ИмяТабличнойЧасти,ТабличноеПолеОбъекта)    Экспорт 
	
	Форма=ЭтотОбъект.ПолучитьФорму();
	
	Если Не Форма.Открыта() Тогда
	     Форма.ОткрытьМодально();
	КонецЕсли;
	
	Если ТолькоСОстатками Тогда 
		МассивТоваров=ТЗ.ВыгрузитьКолонку("Номенклатура");
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("СкладГруппа",Объект.Метаданные())  Тогда
			Если ЗначениеЗаполнено(Объект.СкладГруппа) Тогда
				ГруппаСклад=Объект.СкладГруппа;
			Иначе
				ГруппаСклад=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ГруппаДоступностиСкладов");
			КонецЕсли;
		ИначеЕсли  ОбщегоНазначения.ЕстьРеквизитДокумента("Склад",Объект.Метаданные()) Тогда
			Если ЗначениеЗаполнено(Объект.Склад) Тогда
				ГруппаСклад=Объект.Склад;
			Иначе
				ГруппаСклад=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
			КонецЕсли;
		ИначеЕсли  ОбщегоНазначения.ЕстьРеквизитДокумента("СкладОтправитель",Объект.Метаданные()) Тогда
			Если ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда
				ГруппаСклад=Объект.СкладОтправитель;
			Иначе
				ГруппаСклад=УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
			КонецЕсли;
		КонецЕсли;
		
		
		//ТзОстаков=ОстаткиТоваров(ГруппаСклад,МассивТоваров);
		//Для Каждого строкаТз из ТзОстаков Цикл
		//	   ИскомаяСтрока=ТЗ.Найти(строкаТз.Номенклатура,"Номенклатура");
		//	   строкаТз.Количество=?(ИскомаяСтрока=Неопределено,строкаТз.Количество,Мин(строкаТз.Количество,ИскомаяСтрока.Количество)); 
		//КонецЦикла;	  
	Иначе
		ТзОстаков=ТЗ; 
	КонецЕсли;

	
	
	Если НЕ ТЗ=Неопределено  Тогда
		Объект.Товары.Загрузить(ТзОстаков);
	КонецЕсли;
	
	Для Каждого СтрокаДок из Объект.товары Цикл
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаДок, Объект);

		Если ТипЗнч(Объект)=Тип("ДокументОбъект.ЗаказПокупателя")  Тогда
			Объект.ПриИзмененииНоменклатурыТоваров(СтрокаДок);
		КонецЕсли;
		Если ТипЗнч(Объект)=Тип("ДокументОбъект.ЗаказПоставщику")  Тогда
			
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаДок, Объект, "Приобретение");
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			Объект.Контрагент, Объект.ТипЦен, Объект.ДоговорКонтрагента, Объект.Дата,Объект.ВалютаДокумента, Объект.УчитыватьНДС,Объект.СуммаВключаетНДС);
			
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаДок, Объект, СтруктураШапкиДокумента, Объект.мВалютаРегламентированногоУчета, Истина);
		КонецЕсли;
		
		Если  ТипЗнч(Объект)=Тип("ДокументОбъект.ПоступлениеТоваровУслуг")  Тогда
                  	ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаДок, Объект, "Приобретение"); 

		КонецЕсли;  
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Сумма",Объект.Метаданные(),"Товары") Тогда
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаДок, Объект);
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС",Объект.Метаданные(),"Товары") Тогда
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаДок, Объект);
		КонецЕсли;
		
		Если ТипЗнч(Объект)=Тип("ДокументОбъект.ЗаказПоставщику")  Тогда
            	ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(СтрокаДок, Объект, Объект.мВалютаРегламентированногоУчета);
          КонецЕсли;
		  
		
	КонецЦикла;	

	
	Тз=Неопределено;
	
КонецПроцедуры	

	

Функция мПрочитатьТабличныйДокументИзCalc(ТабличныйДокумент, ИмяФайла, НомерЛистаCalc = 1) Экспорт

    ВыбФайл = Новый Файл(ИмяФайла);
    Если НЕ ВыбФайл.Существует() Тогда
        Сообщить("Файл не существует!");
        Возврат Ложь;
    КонецЕсли;

    Попытка
        ServiceManager = Новый COMОбъект("com.sun.star.ServiceManager");
        Desktop = ServiceManager.CreateInstance("com.sun.star.frame.Desktop");
        Desktop.getCurrentFrame().getContainerWindow().setVisible(Ложь);  //невидимым основное окно.

        //установим параметры - не показывать таблицу Calc
        Параметры = Новый COMSafeArray("VT_DISPATCH", 1);
        Свойство = ServiceManager.Bridge_GetStruct("com.sun.star.beans.PropertyValue");
        Свойство.Name = "Hidden";
        Свойство.Value = true;
        Параметры.SetValue(0,Свойство);

        Document = Desktop.LoadComponentFromURL("file:///" + ИмяФайла, "_blank", 0, Параметры);
        Состояние("Обработка файла Office Calc ...");
        Листы = Document.getSheets();
        Лист = Листы.getByIndex(НомерЛистаCalc-1);
    Исключение
        Сообщить("Ошибка загрузки данных. Возможно неверно указан номер листа книги Calc.");
        Возврат ложь;
    КонецПопытки;

    ТабличныйДокумент.Очистить();

    //Определение максимум ячейки с данными...
    НульЯчейка = Лист.GetCellbyPosition(0,0);
    НульКурсор = Лист.createCursorByRange(НульЯчейка);
    НульКурсор.GotoEndOfUsedArea(1);
    НульАдрес  = НульКурсор.RangeAddress;
    ПослСтрока = НульАдрес.EndRow;
    ПослКолонка = НульАдрес.EndColumn;
	
	Для Column = 1 По ПослКолонка + 1  Цикл     
		Для Row = 1 По ПослСтрока + 1  Цикл     
			
			Если Лист.getCellByPosition(Column-1,Row-1).getType() = 0 Или Лист.getCellByPosition(Column-1,Row-1).getType() = 1 Тогда      
				
				ТабличныйДокумент.Область("R" + Формат(Row, "ЧГ=") +"C" + Формат(Column, "ЧГ=")).Текст = Лист.getCellByPosition(Column-1,Row-1).value;
				
			ИначеЕсли Лист.getCellByPosition(Column-1,Row-1).getType() = 2 Тогда
				
				ТабличныйДокумент.Область("R" + Формат(Row, "ЧГ=") +"C" + Формат(Column, "ЧГ=")).Текст = Лист.getCellByPosition(Column-1,Row-1).string;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
    //ServiceManager.quit();
    Document.Dispose();
    Document = 0;
    Параметры = 0;
    Desktop = 0;
    ServiceManager = 0;

    Возврат Истина;

КонецФункции



