
&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика.
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.ВидыНоменклатуры";
	
	Тз = Запрос.Выполнить().Выгрузить();
	
	ТзСсылока=НайтиПоСсылкам(Тз.ВыгрузитьКолонку("Ссылка"));
	
	Для Каждого Ссылка из ТзСсылока Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + СокрЛП(Ссылка[0]) + "  " + СокрЛП(Ссылка[1]);
		//Сообщение.Поле = "";
		Сообщение.УстановитьДанные(Ссылка[0]);
		Сообщение.Сообщить();
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
