Перем мфНаименованиеСвойстваРазмер;
Перем мфНаименованиеСвойстваРазмерRUS;
Перем мфНаименованиеСвойстваАртикул;

&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика.
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
		мфНаименованиеСвойстваРазмер="Размер (Справочник ""Характеристики номенклатуры"" (Общие))";
	мфНаименованиеСвойстваАртикул="Артикул (Справочник ""Характеристики номенклатуры"" (Общие))";

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект,
		|	ДополнительныеСведения.Свойство,
		|	ДополнительныеСведения.Значение
		|ПОМЕСТИТЬ Размеры
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
		|	И ДополнительныеСведения.Свойство.Ссылка = &СвойствоРазмер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Объект,
		|	ДополнительныеСведения.Свойство,
		|	ДополнительныеСведения.Значение
		|ПОМЕСТИТЬ Артикулы
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
		|	И ДополнительныеСведения.Свойство.Ссылка = &СвойствоАртикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Артикулы.Объект, Размеры.Объект) КАК Объект,
		|	Артикулы.Значение КАК Артикул,
		|	Размеры.Значение КАК Размер
		|ИЗ
		|	Размеры КАК Размеры
		|		ПОЛНОЕ СОЕДИНЕНИЕ Артикулы КАК Артикулы
		|		ПО Размеры.Объект = Артикулы.Объект";
	
	//Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);
	Запрос.УстановитьПараметр("СвойствоРазмер", СвойствоРазмер);
	Запрос.УстановитьПараметр("СвойствоАртикул", СвойствоАртикул);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТзСвойсвтв=ПолучитьТзСвойств(НаборСвойств);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СтруктХарактеристики=Новый Структура("Артикул, Размер");
		ЗаполнитьЗначенияСвойств(СтруктХарактеристики, ВыборкаДетальныеЗаписи);
		
		СоздатьОбновитьХарактеристику(ВыборкаДетальныеЗаписи.объект, СтруктХарактеристики, ТзСвойсвтв)

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

Процедура СоздатьОбновитьХарактеристику(пХарактеристика,пДанныеДляСозданияХарактеристики, пТзСвойсвтв)

	
	НоваяХарактеристика=пХарактеристика.ПолучитьОбъект();
	
	//НоваяХарактеристика.Владелец=пНоменклатура;
	//НоваяХарактеристика.Наименование=пДанныеДляСозданияХарактеристики.Наименование;
	//НоваяХарактеристика.НаименованиеПолное=НоваяХарактеристика.Наименование;

	
	СтруктСвойств=Новый Соответствие;
	СтруктСвойств.Вставить(мфНаименованиеСвойстваРазмер, пДанныеДляСозданияХарактеристики.Размер);
	//СтруктСвойств.Вставить(мфНаименованиеСвойстваРазмерRUS, пДанныеДляСозданияХарактеристики.РазмерRUS);
	СтруктСвойств.Вставить(мфНаименованиеСвойстваАртикул, пДанныеДляСозданияХарактеристики.Артикул);
	
	
	ЗаполнитьТЧ_Свойств(НоваяХарактеристика.ДополнительныеРеквизиты, СтруктСвойств, пТзСвойсвтв);

	
	Попытка
		ТекстСообщение="Записана хар-ка";
		НоваяХарактеристика.Записать();
		//пДанныеДляСозданияХарактеристики.Характеристика=НоваяХарактеристика.Ссылка;
		//ВывестиИнормацию_о_записиОбъекта(пДополнительныеРеквизитыНоменклатуры, ТекстСообщение, НоваяХарактеристика.Ссылка);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;

	
	
	//ЗаписатьСвойстваХарактеристики(НоваяХарактеристика.Ссылка, СтруктСвойств, пТзСвойсвтв);

	
КонецПроцедуры


Функция ПолучитьТзСвойств(пНаборСвойств)
	
	Перем Запрос, РезультатЗапроса, ТзСвойсвтв;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка,
	|	ДополнительныеРеквизитыИСведения.Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств
	|	И ДополнительныеРеквизитыИСведения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НаборСвойств", пНаборСвойств);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТзСвойсвтв=РезультатЗапроса.Выгрузить();
	Возврат ТзСвойсвтв;

КонецФункции // ()



Процедура ЗаполнитьТЧ_Свойств( ТчСвойств, СтруктСвойств, ТзСвойсвтв)
	
	
	Для Каждого Свойство из  СтруктСвойств Цикл
		
		
		МассивСтроТкз=ТзСвойсвтв.НайтиСтроки(Новый Структура("Наименование",Свойство.Ключ ));
		
		Если МассивСтроТкз.Количество()=0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдено св-во "+Свойство.Значение;
			Сообщение.Сообщить();
			Продолжить;
		Иначе
			СвВо=МассивСтроТкз[0].ССылка;
		КонецЕсли;	
			

		НоваяСтрокаТЧ=ТчСвойств.Добавить();

		НоваяСтрокаТЧ.Свойство = СвВо; 
		НоваяСтрокаТЧ.Значение = Свойство.значение;
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
